# Задайте последовательность чисел. Напишите программу, которая выведет
# список неповторяющихся элементов исходной последовательности.

myList = [23, 454, 63, 453, 543, 45, 435, 453, 5435, 45]
mySet = set(myList)
print(myList)
print(mySet)