currencies = {
    'usd': 'Доллар США',
    'aud': 'Австралийский доллар',
    'byn': 'Белорусский рубль',
    'eur': 'Евро',
    'cny': 'Китайский юань',
    'rub': 'Российский рубль',
    'brl': 'Бразильский реал',
    'hkd': 'Гонконгский доллар',
    'ils': 'Израильский шекель',
    'inr': 'Индийская рупия',
}
help_data = {
    'from': None,
    'to': None,
    'count': None
}
steps = ['<b>Шаг первый:</b> нажмите кнопку Конвертировать в меню',
         '<b>Шаг второй:</b> выберете из какой валюты хотите конвертировать.',
         '<b>Шаг третий:</b> выберете в какую валюту хотите конвертировать',
         '<b>Шаг четвертый:</b> напишите сумму единиц валюты которую хотите конвертировать и нажмите ввод']
